import type { AboutInfo } from '@/widgets/AboutBlock'

export const aboutBlocks: AboutInfo[] = [
  {
    title: 'О себе',
    texts: [
      // 'Привет! Меня зовут Самир. Я fullstack-, android- и ios-разработчик со стажем более 3,5 года.',
      // 'Мой путь разработчика весьма интересный и разносторонний. '
      // + 'Как написано выше, я разработчик в разных направлениях и работал в каждом стеке одновременно, а не переодично.',
      // 'Я выбрал frontend как основную сферу своего развития просто потому что мне он больше нравится.',
      // 'Долгие годы моим основным стеком был: React + Redux + Saga, но на этом я решил не останавливаться и именно поэтому '
      // + 'Вы сейчас видите данную работу!',
      // 'Приятного просмотра!',
      '1 строка',
      '2 строка',
      '3 строка',
    ],
  },
  {
    title: 'О проекте',
    texts: [
      // 'Данный проект в основном разрабатывался с целью изучения FSD и практики в Mobx.',
      // 'Проект предназначен для учета погрузки и отправки грузовых автомобилей.',
      // 'Не стоит искать смысл проекта в реальной жизни, все таки он учебный :)',
      // 'Проект делался без макета и на "скорую руку" в плане дизайна. Больше упор был на изучение архитектуры.',
      '1 строка',
      '2 строка',
    ],
    imageSource: '',
  },
]
